// Написать программу, которая выводит на экран числа от 1 до 100. При этом вместо чисел, кратных трем, программа должна выводить слово Fizz, а
// вместо чисел, кратных пяти - слово Buzz. Если число кратно 15 - слово FizzBuzz. Задача может показать очевидной, но нужно получить наиболее
// красивое и простое решение.

int i = 1;

while (i < 101)
{
    if (i%15 == 0)
    {
        Console.WriteLine("FizzBuzz");
    }
    if (i%5 == 0)
    {
        Console.WriteLine("Buzz");
    }
    if (i%3 == 0)
    {
        Console.WriteLine("Fizz");
    }
    else
    {
        Console.WriteLine(i);
    }
    i++;
}

